app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."host_id" = $1  [["host_id", 23]]
---
  def show
    @user = User.find(params[:id])
    @events = Event.where(host_id: current_user.id)

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "description" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Lilian"], ["last_name", "Muller"], ["description", "coucou"], ["updated_at", "2021-11-10 09:08:11.282817"], ["id", 23]]
---
  def update
    @user = current_user
    if @user.update(first_name: params[:user_first_name], last_name: params[:user_last_name],
                    description: params[:user_description])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def same_user?
    @user = User.find(params[:id])